Repository: SharifDataDays/website-2019
Catalog: apps/accounts/locale/*/LC_MESSAGES/django.po
Languages: fa

source: Please enter your phone number correctly!
fa: لطفاً شماره ی تلفن خود را درست وارد کنید!

source: Registration is closed. See you next year.
fa: ثبت نام هم‌اکنون باز نیست. به امید دیدار شما در رقابت بعدی.

source: English name must be fully english and contain only [a-z][A-Z][ ][.] characters.
fa: نام انگلیسی شما باید به طور کامل با حروف کوچک یا بزرگ الفبای انگلیسی وارد شود.

source: Persian name must be fully Persian and contain only arabic character set plus [ ][.] characters.
fa: نام فارسی شما باید به طور کامل با حروف الفبای فارسی تایپ شود.

source: Student id must only contain [0-9].
fa: شماره دانشجویی شما باید فقط شامل ارقام ۰ تا ۹ باشد.

source: entrance year must be between [1385, 1397] or [2002, 2019]
fa: سال ورود شما باید در بازه‌ی [۱۳۸۵،‌۱۳۹۷] و یا [۲۰۰۲،۲۰۱۹] باشد.

source: Submission is closed.
fa: ارسال‌ها

source: Max file size is 5MB.
fa: بیشترین حجم فایل قابل استفاده ۵ مگابایت است.

source: First submit a compilable code.
fa: ابتدا یک کد قابل کامپایل ارسال کنید.

source: You have to be one of participants.
fa: شما به این منبع دسترسی ندارید.

source: You have to wait at least %(minutes)s minutes between each match!
fa: بین هر دو بازی دوستانه باید حداقل %(minutes)s دقیقه صبر کنید.

source: Required,Choose a suitable name for your team
fa: انتخاب نام تیم لازم است!

source: Registration is not open.
fa: ثبت نام هم‌اکنون باز نیست.

source: This name is used by another team
fa: این نام قبلا توسط تیمی دیگر استفاده شده است!

source: You can't add same users to your team
fa: لطفا دو کاربر تکراری برای تیم انتخاب نکنید!

source: You must select a second member for your team
fa: لطفا دو کاربر تکراری برای تیم انتخاب نکنید!

source: Some of the users are already participating in this challenge
fa: بعضی از کاربران انتخاب شده قبلا در این رقابت شرکت کرده‌اند!

source: The user is already participating in this challenge
fa: بعضی از کاربران انتخاب شده قبلا در این رقابت شرکت کرده‌اند!

source: No more capacity in this challenge.
fa: تیم در این چالش دیگر ظرفیت ندارد!

source: Mobile number‌
fa: شماره موبایل

source: Organization‌
fa: دانشگاه/مدرسه

source: Age‌
fa: سن

source: National code‌
fa: کد ملی

source: Telephone number‌
fa: شماره ی تلفن ثابت

source: bachelor
fa: کارشناسی

source: master
fa: کارشناسی ارشد

source: phd
fa: دکترا

source: Full Name EN‌
fa: نام و نام خانوادگی (به انگلیسی)

source: Full Name FA‌
fa: نام و نام خانوادگی (به فارسی)

source: Student ID‌
fa: شماره دانشجویی

source: Major‌
fa: رشته تحصیلی

source: Entrance Year‌
fa: سال ورودی

source: Degree‌
fa: مدرک تحصیلی

source: City‌
fa: شهر

source: T-Shirt Size‌
fa: سایز تی شرت

source: Scoreboard
fa: جدول امتیازات

source: Rank
fa: رتبه

source: Name
fa: نام تیم

source: Score
fa: امتیاز

source: total num
fa: مجموع

source: win num
fa: برد

source: lose num
fa: باخت

source: Battle history
fa: بازی‌های دوستانه

source: Time
fa: زمان

source: Team
fa: نام تیم

source: Oponent Score
fa: امتیاز حریف

source: View
fa: نمایش

source: Log
fa: گزارش

source: Download
fa: دانلود

source: Running
fa: در حال اجرا

source: Versus:
fa: حریف:

source: Map:
fa: نقشه:

source: Submit
fa: ارسال

source: Challenge:
fa: رویداد:

source: Error scheduling match.
fa: خطا در ایجاد بازی دوستانه.

source: Successfully scheduled friendly match.
fa: بازی دوستانه با موفقیت در صف اجرا قرار گرفت.

source: Panel
fa: پنل

source: You are invited to the team
fa: شما به تیم

source: on the challenge
fa: در رقابت

source: , do you accept?
fa: دعوت شده اید، آیا می‌پذیرید؟

source: Members are:
fa: اعضا:

source: Accept
fa: پذیرفتن

source: Reject
fa: ردکردن

source: Create New Team
fa: ایجاد تیم جدید

source: Submissions
fa: ارسال‌ها

source: Selected
fa: انتخاب‌شده

source: Language
fa: زبان

source: Status
fa: وضعیت

source: Compiled Successfully
fa: با موفقیت کامپایل شد

source: Compiled
fa: کامپایل‌شده

source: Click To View
fa: برای نمایش کلیک کنید.

source: Failed
fa: ناموفق

source: Compile Error
fa: کامپایل‌شده

source: The Log From Compiler Is Shown Below:
fa: نتیجه کار کامپایلر:

source: OK
fa: باشه

source: Failed to upload. You may contact the technical team.
fa: فرایند آپلود کامل نشد. لطفا این مورد را به تیم فنی اطلاع دهید.

source: Failed To Upload
fa: آپلود ناموفق

source: We are compiling your code! Wait and refresh your page.
fa: ما در حال کامپایل کردن کد شما هستیم. صبر کنید و صفحه را مجددا ببینید.

source: Compiling
fa: در حال کامپایل

source: File:
fa: فایل:

source: Language:
fa: زبان:

source: Caution: Submissions get final when they are successfully compiled!
fa: توجه:‌ ارسالهایی که با موفقیت کامپایل شوند به عنوان ارسال نهایی شما تنظیم می‌شوند.

source: Team Status
fa: وضعیت تیم

source: Username
fa: نام کاربری

source: Remove
fa: حذف

source: Accepted
fa: پذیرفت

source: Add a member
fa: اضافه کردن عضو

source: All users have accepted the challenge.
fa: تمام اعضا شرکت در مسابقه را تایید کرده‌اند.

source: All users haven't accepted the challenge yet!
fa: هنوز همه اعضا شرکت در مسابقه را تایید نکرده‌اند.

source: You have to complete the team information and pay to continue to this challenge.
fa: برای ادامه کار در این چالش باید اطلاعات تیم خود را تکمیل کرده و پرداخت کنید.

source: Pay
fa: پرداخت

source: Tomans
fa: تومان

source: Payment completed
fa: پرداخت کامل شد.

source: You paid more than what your team should pay contact us to return money
fa: شما به اشتباه بیشتر از مبلغ مورد نیاز پرداخت کرده‌اید. با ما تماس بگیرید تا مبلغ را به حساب شما برگردانیم

source: Back To Panel
fa: بازگشت به پنل

source: Get a new trial
fa: ایجاد یک تلاش جدید

source: Score
fa: امتیاز

source: Judging ...
fa: در حال داوری ...

source: Part One Score
fa: امتیاز بخش اول

source: Part Two Score
fa: امتیاز بخش دوم

source: Part Three Score
fa: امتیاز بخش سوم

source: Trial
fa: تلاش

source: Start Time
fa: زمان شروع

source: Time Left
fa: زمان باقی مانده

source: Submit Time
fa: زمان گذشته از ارسال

source: final trial
fa: تلاش نهایی

source: View Trial
fa: مشاهده‌ی تلاش

source: Download Dataset
fa: دانلود دادگان

source: Upload Answer
fa: بارگذاری پاسخ

source: No answer yet : Number field
fa: هنوز پاسخی نداده‌اید: مقدار عددی

source: No answer yet : Text field
fa: هنوز پاسخی نداده‌اید: مقدار متنی

source: Uploading, Wait and refresh the page.
fa: ما در حال کامپایل کردن کد شما هستیم. صبر کنید و صفحه را مجددا ببینید.

source: Uploading
fa: در حال بارگذاری

source: Has NOT filled their information yet
fa: هنوز اطلاعات خود را وارد نکرده است.

source: You have not participated in this challenge yet.
fa: شما در این چالش شرکت نکرده‌اید.

source: Sign Up
fa: ثبت نام

source: Complete Information
fa: تکمیل اطلاعات

source: Update
fa: ذخیره

source: Login
fa: ورود

source: Password
fa: رمز

source: I forgot my password
fa: رمزم را فراموش کردم

source: SignUp Form
fa: ثبت نام

source: First Name
fa: نام

source: Last Name
fa: نام خانوادگی

source: University
fa: دانشگاه

source: Phone Number
fa: شماره ی تلفن

source: Email
fa: ایمیل

source: Password Confirm
fa: تکرار رمز

source: SignUp
fa: ثبت نام

source: Sign up
fa: ثبت نام

source: Add a member to
fa: اضافه کردن عضو به

source: Add
fa: اضافه کن

source: Error!
fa: خطا!

source: Create Team
fa: ایجاد تیم

source: Before creating a team all of your team members should register on the site. Then, enter their usernames here. Your team can have up to 3 members.
fa: قبل از تشکیل تیم همه اعضای تیم باید در سایت ثبت ‌نام کرده باشند. سپس برای ثبت تیم، نام کاربری آنان را اینجا وارد کنید. تیم شما می ‌تواند حداکثر ۳ عضو داشته باشد.

source: Team Name
fa: نام تیم

source: First Member
fa: عضو اول

source: Second Member
fa: عضو دوم

source: Third Member
fa: عضو سوم

source: Your team has been created successfully
fa: تیم شما با موفقیت ساخته شد

source: Request messages has bee sent to your teammates
fa: درخواست عضویت به هم تیمی های شما فرستاده شد

source: Total Scoreboard
fa: امتیازات نهایی

source: Phase 1 From 10000
fa: فاز یک از ۱۰۰۰۰

source: Phase 1 Final Score
fa: امتیاز نهایی فاز یک

source: Phase 2 From 10000
fa: فاز دو از ۱۰۰۰۰

source: Phase 2 Final Score
fa: امتیاز نهایی فاز دو

source: Final Score From 20000
fa: امتیاز نهایی از ۲۰۰۰۰

source: First Half Score
fa: امتیاز نیمه اول

source: Second Half Score
fa: امتیاز نیمه دوم

source: You have one active trial.
fa: شما در حال حاضر یک تلاش باز شده دارید.

source: You can not get any new trial.
fa: شما نمی‌توانید تلاش جدیدی را شروع کنید.

source: You can not get any new trial. You have reached your limit in current day
fa: شما حداکثر تعداد تلاش‌های روزانه خود را استفاده کرده‌اید.

source: no such trial
fa: تلاشی یافت نشد.

source: final trial set successfuly
fa: تلاش نهایی با موفقیت ثبت شد
